{
    "popups": [
        {
            "id": "HUP_POPUP",
            "title": "Había un Pueblo",
            "description": "En este videojuego el jugador explora para capturar distintos mitos y leyendas de la cultura colombiana, interactuando con otros personajes, resolviendo puzles y superando minijuegos. En este proyecto me encargué de programar todos los aspectos del juego, desde la lógica de los minijuegos hasta la interfaz de usuario.",
            "useslist": "Los conocimientos que apliqué para este proyecto incluyen:\n   • Uso del New Input System.\n   • Implementación del terreno con Rule Tiles.\n   • Sistema de diálogos por medio de Scriptable Objects.\n   • Conceptos de POO como la abstracción y herencia."
        },
        {
            "id": "VHS_POPUP",
            "title": "Video Horror Story (VHS)",
            "description": "Un proyecto corto en el que él jugador explora una casa llena de sombras tenebrosas, de las que se puede defender al lanzarles objetos como lámparas o platos. Para este proyecto, me encargue de programar algunas interacciones entre el jugador y el mundo, como la recolección y lanzamiento de objetos.",
            "useslist": "Los conocimientos que apliqué para este proyecto incluyen:\n   • Físicas 3D.\n   • Navigation Meshes.\n   • Variantes de Prefabs."
        },
        {
            "id": "HR_POPUP",
            "title": "Hamster Roller",
            "description": "Un juego de plataformas en el que el jugador puede cambiar de forma para superar obstáculos y recolectar semillas. Para este proyecto aporte la programación de cambio de formas, así como la de recolección de colectables y las condiciones de ganar y perder.",
            "useslist": "Los conocimientos que apliqué para este proyecto incluyen:\n   • State machines.\n   • Uso de prefabs.\n   • Uso de Blend Trees."
        },
        {
            "id": "LDSLN_POPUP",
            "title": "Los Duendes Salvan la Navidad",
            "description": "Un juego corto tipo arcade en el que el jugador recolecta duendes para aumentar su contador de regalos e impedir que se le acabe el tiempo. Para este proyecto fui el encargado de programar el movimiento de los personajes y las mecánicas de juego principales.",
            "useslist": "Los conocimientos que apliqué para este proyecto incluyen:\n   • Variantes de prefabs.\n   • Implementación del terreno con Rule Tiles.\n   • Uso de Blend Trees."
        },
        {
            "id": "NMA_POPUP",
            "title": "No Más Alergias",
            "description": "Un juego educativo para jugar en buscador o dispositivos Android que desarrollé durante mi tiempo como practicante en La Agencia UAO, para la compañía farmacéutica Inmunotek. El juego apunta a explicar lo que son las alergias y la inmunoterapia a la población infantil.",
            "useslist": "Los conocimientos que apliqué para este proyecto incluyen:\n   • Patrón de Singleton.\n   • Animator Override Controllers.\n   • Implementación de interfaces de Drag and Drop."
        },
        {
            "id": "RM_POPUP",
            "title": "Robot Mafia",
            "description": "Un proyecto que estamos desarrollando actualmente. Se trata de un juego de puzles y acción en el que el jugador usa reflejos y ángulos para rebotar sus proyectiles y eliminar enemigos.",
            "useslist": " "
        },
        {
            "id": "LaIA_POPUP",
            "title": "LaIA",
            "description": "LaIA es una campaña universitaria a la que contribuí durante mi tiempo como practicante en La Agencia UAO. Mis aportes consistieron en animar al personaje en distintas situaciones. El personaje tuvo presencia tanto en video entrevistas como animaciones publicitarias cortas.",
            "useslist": "Los conocimientos que apliqué para este proyecto incluyen:\n   • Animación en After Effects.\n   • Lip Sync.\n   • Uso dinámico entre Illustrator y After Effects."
        },
        {
            "id": "Fundautonoma_POPUP",
            "title": "Sentidos FundAutónoma",
            "description": "Una serie de dos comerciales que desarrollé para la organización sin ánimo de lucro creada por la universidad Autónoma de Occidente. Tuve el privilegio de visitar la fundación para filmar y dirigir las tomas del segundo comercial y de incluso dirigir su voz en off.",
            "useslist": "Los conocimientos que apliqué para este proyecto incluyen:\n   • Rotobrush de After Effects.\n   • Grabación de audio con Avid Pro Tools.\n   • Uso de Dynamic Link entre Premiere Pro y After Effects.\n"
        },
        {
            "id": "AgenciaUAO_POPUP",
            "title": "Reel La Agencia UAO",
            "description": "Un video presentando los servicios, productos y clientes de La Agencia UAO que realicé durante mi tiempo como practicante.",
            "useslist": "Los conocimientos que apliqué para este proyecto incluyen:\n   • Cámara 3D en After Effects.\n   • Sincronización entre video y música en Premiere Pro.\n   • Uso de Dynamic Link entre Premiere Pro y After Effects."
        },
        {
            "id": "CincuentaAnos_POPUP",
            "title": "Video caso 50 Años UAO",
            "description": "Un video que edité durante mi tiempo como practicante en La Agencia UAO. En él se detalla el proceso que se llevó acabo para diseñar la marca del aniversario de 50 años de la universidad Autónoma de Occidente.",
            "useslist": "Los conocimientos que apliqué para este proyecto incluyen:\n   • Uso de Motion Blur en After Effects.\n   • Animación de texto en After Effects.\n   • Uso de Dynamic Link entre Premiere Pro y After Effects."
        }
    ]
}